import torch

###############################################

EXP_NAME = "CHINESE-HWT-Run2"; RESUME = False

DATASET = 'CHINESE_128'
if DATASET == 'IAM':
    DATASET_PATHS = 'files/IAM-32.pickle'
    NUM_WRITERS = 339
if DATASET == 'CVL':
    DATASET_PATHS = 'files/CVL-32.pickle'
    NUM_WRITERS = 283
if DATASET == 'CHINESE':
    DATASET_PATHS = 'files/CHINESE-32.pickle'
    NUM_WRITERS = 576 # 替換為您 train 資料夾下的真實作者(資料夾)數量
if DATASET == 'CHINESE_128':
    DATASET_PATHS = 'files/CHINESE-128.pickle'
    NUM_WRITERS = 576 # 替換為您 train 資料夾下的真實作者(資料夾)數量
# ENGLISH_WORDS_PATH = 'files/english_words.txt'
ENGLISH_WORDS_PATH = 'files/chinese_words.txt'


###############################################

IMG_HEIGHT = 128
resolution = 128
batch_size = 32
NUM_EXAMPLES = 5#15
TN_HIDDEN_DIM = 512
TN_DROPOUT = 0.1
TN_NHEADS = 8
TN_DIM_FEEDFORWARD = 512
TN_ENC_LAYERS = 3
TN_DEC_LAYERS = 3
ALPHABET = '池律聂猾噶窟滴笔呐慕暖被觉才仇可雹鲤陆绑顶攻么贷满劳澜牛韭攫剐厚东诀猫监亮仓奎彼谷距拉棵愁界昏帛阿督浮菱够谗旷挥疥蛮娜肋何较跺垫掇廊迪靠答罚犁领秘褐寐猛叭膊凑谰份锚恨皇忽鹅铝肛互眯烩梦鸟架剑蜡齿灿卖方封科赫冬绩晾零洛睹奋宠挠竟鄂扶吼涤府街铂盾犯腊憾镑鳞莫后脚彬淬梅出茨您饭晋港冻喀工钝睦畴筷傍宽垒弛怪寄割旦技曼饥本敌秸吏固泥娥壁迟持釜拿姆代定国捣露骸娄喉骂话氨负庙馈捶骡叫草甸奠靡军乎抹斧卜袱涅伯裹昂反螟端轮滤铬慢路矿局呢采搓筐媚彻跌革焦恢霉酚酪豢汉飞胆蝉寸蜂赌哈集刀航巨撼边蔑眠澈饿段浚宦氟琅磺窥差此翅菌玫结伏恩管据芭猎丢膀啦绝捏率炬敦篙焙怒脯厉亢翱励镭傀蛋服崩阑桨护澳理藕阶叼郴垃冯缝刘内镁焕鄙鹿格包邓渺白弥矫隆串诡变顾废漓氖宝见氓汞歹菜俩换馁基赋处醚闷枚尿霸玖姑例锰乐梗那斑读办鼎匪甫酿涝贺雌伴糊农仿核柴纠女唇括粗聊恐锻京顿豪半吵簿芦等淖涣己供部侯圾戈并冒姜逢鞍哼鸣力划鹤解纪官都葛傈勘煎嚼阐倪鲍礼敏挪册匙词瘪巩牧刮咎布拐竭肝帝寞庇缄霖铰诚兑伦廉层敷诺讲带睛梆戳蚌句慨搐良耽碟件涵坊箍虎粒晦缆粳扩凹警烈雷侣卯介额丙涧哺颠借矾牡瞄靶讹聪疙黄琉断龟夺沪笺跪肠辩棱颈篓绰林迈蔓钩俄钾经郊来珐康建冠观利逞轿孤和瘩蕾柑笨疆妓滇寇对勒镐获初发凉摆担铆垦闭哄颁锣硅敞个辊醋锋茅绞逮糠驰辐能荤扼函档创姬狸烬劫穿济膏辉袋搏饯防队饵郎潮饱低凡蠢懒隶锄框壕号隔硫帆回俺宾驹恶倒拌母没溃剁从贵赣淋绿旧尽贸连老吩寂拘键仑鸽决蹿及鳖劲撂渡袄菏棺兜貉峰绊霓魂级摈冲过稿柬龚灵襟狠徽操钒冕健牟丽村轨锯粹昧啊百拱棍赂磨篡兼靛敢际茶多橱弓缔朗磷绸劣煤钧困敛材臣滑疗戴秽溜囱遍梁铲忿傣筋坎葫囤吧哩彪今楷故渐络弗六倦厄锦忙搭博唱祷慈衬佰盯凝径购葱颤濒冀粮夫卞陋吹掂沮惭猴柠尼诫拜沉肥犊滚峨睬截鹃马驳滨疟父趁传擦帽卢挤锭杭克机剿裁竣驾浇汾怜垂遏病纺皑广楞骋暴僚厩践辆地奥俘承害长捕北栏蒂量榔步侈精磊寒南车钠斌竿耻鸡哆辨很杰暮不浩痉类盟肩钞迸烤彩儿踞单复播开灌耕岿甘颅殿翻裂漠赶案刚籍孩缓临氛磁撑几撵泵鼓裤查赤繁沫愧穆活爆牢茫涟井继唉货览堪臼徊甲把码毙呆蛊脆景扮疤拨爵立惠碘描每累胯难肤腻们痴喇记蔫搅辈化谍独币铃近衡洞妹芒钙会虐恭欢抽酶躇糕撤陌腑戮懦卵成诽捡救晃祭惦盲笼挡福酱抗掘考篱惯卉辑爹坤哥拢箕翟雏将俊贰除谋奈炽即璃典赴钡槽光报垢勉殴膘翰海快苍诞分空口付贱豁莉荆陡班好瘁幕蹬嘉煌厕镜股狞场盖爱苛表搁匡惮菇鬼居佬免打毁尖昆咳耳波倍殆灰碍湖联郡伶奔爸稼拈烽萝婪磕拆椿储佳辣苞稠蜜斗搽点矗骏财课晶焊骄丰感吗黑嫩钵吕邻佛红抉缎而棒镊肚聚儡净泪岛螺炼称槐混郸脊笆慷吝钮苦登接敬辞葵跟亥凋你逆韩赖丛列砍寡毛舵壶比冈弄奴吭静盎命脸明摹酵岔举掣非蒋检纲咙绢驴睫炊乖悯鞭还氮闺妒腐剧覆陵蒙贯欧肌侗圭改高巴烂凳荷晨藩幻埠编窗躬妨目崇舶城痘简凰狄胡碧淀崔尔脓怠鼻九蚂墨狐啡恫悍垮堡禄阁廓或撮枫耿绷流峦艾缠存弹夯龙纶捻盒馆禾剂拦按颗埃矮朵沽汇沧副念悲枷米谨皆喝姥辅憋秉唤滥便岭镀俭到佃浆怀侧燎但卷斥胶匠就枯瓣楼两令麦黎缸啃促党归痹玲虏抚匿蚕环旅甭潦勾嚎亩莱积根耙补胞狙恒花床厨刊安诧陈荔猜洪坏搀插椒褂肮氦沸叠度吉教掺贩醇浓蔡呵苟节汲郭窘狗讽痢默悼嘎钢荡抿柜冷渴觅哪婚孟溺道蹦共缴练轰般漫呈礁靖留貌录讳耗屡八簇盔捌茎逛炯栋扭讥待肯论孽藉妈堤祸控菠宏岸擂拣碑眷超哗捐俐窖侩栗糜偿勃链火拟桓孵灯蛤测扳揭干垛更谩惨憨风抄告挫骨肪虹辽抖咐踌歌惶烦焚筏撅亨鉴亏缅棉搞膜嘲沟昌动舰浪块滁狼暗堕卤间棘骆规交萌果筹蝴缉碴拷洱淮谜脉杜廖墩瞅唬脖苯辰泞刻赁钓奸箩恋察错蓖版镣闯埋某摩凤公帮镍菲疮咕范舅辫澄踩罗倡捍灭纯尘娇得峻忌潞谎雕芳败榴篮姐胳曹功朝弧法眶滦阀房华酣咯了跋否搂电隘俯患杆奶木逗吨扛金兵美躲揣哀恳叉椽薄策荒媒沥馋稗惰摸贿橙必痪伎板藏关角慌蓝催莽合疽鸥二熬粪巾拂富蔼剥坑渤刺啮麻酒倔第凯次茧娘德哎概捞充咖酬撩给里忱谅庚矩羚羹尺阂粉纳竞堆溅琳离喊价门掉魁硷纽杯艰别凌弊大坷抱究遁递董窜翠玛况夸侥乱模癸疚吃费巢柄贝霍罕芬鸿该既虫讣短溉敖嫁卡缕库搬冰涸民达苗炕辟垄估魔历箭悸放季泊蔽炳仅础粱幢绘矛悔落壳各禁瞒饺辜看汗坝傅蛔瑚榜掠厂瞪骇氯蹲柳幌掸参缚褒蝗拒浸邦旱毫傲臭幅久蘑檬陛妮末砾伙弟迷铭贾镰底瓷刁懂蕉沦户哭荚措激茂慧鲁古挂瑰稽皿荐毖略簧候尝阜莲纷匆君靳虑墓拎符僵逼贬邯芥厘触箔笛附拧咀乘钉抠闹常柏糙订挛拇懊盗泛俱假跨船菊履背斤捆磅备浑狡碾闽碌碱乏庐卑剪畸陇郝槛敝兢疵耐计瘤春料雇嫡募妙茬龄丁炒掳惊豺癌挎脑凛境避孔肺柯妇埂坟罐丹餐谤幂嘛揩加樊怖吊捷洁皋紧丑保淡返导届款毕胺店秒面堵羔访奖歼磋贡密番秤摧扣努狂豹馒猖河赐川臂乃蓟糯罢弘稻减馏梨程玻奉烘戒淳秆残鞠男家藐伐扯津惧江窿扒谬阔诲囊惑买寥鲸毒李锅宫蹈构呼畅豆调兰迹宁另坚均揽逻狈蝶腹哦聋挨愤涪桂锤迭漏烙惩抡恍抵绵标瓜具当拔恼画泌扁惫裸喘舱娩名桔吠颊夹叮碉进灸疯的年刽帘急痕降楚客杠嘿击产炉疾麓酷岗孪含蹭眉蛾娟横揪嫉极饼'
VOCAB_SIZE = len(ALPHABET)+1
G_LR = 0.0001
D_LR = 0.00002
W_LR = 0.00002
OCR_LR = 0.0005
EPOCHS = 100000
NUM_CRITIC_GOCR_TRAIN = 2
NUM_CRITIC_DOCR_TRAIN = 1
NUM_CRITIC_GWL_TRAIN = 2
NUM_CRITIC_DWL_TRAIN = 1
NUM_FID_FREQ = 1000000000

DEVICE = torch.device("cuda" if torch.cuda.is_available() else "cpu")
IS_SEQ = True
NUM_WORDS = 1
if not IS_SEQ: NUM_WORDS = NUM_EXAMPLES
IS_CYCLE = False
IS_KLD = False
ADD_NOISE = False
ALL_CHARS = False
SAVE_MODEL = 1000
SAVE_MODEL_HISTORY = 1000000000

def init_project():
    import os, shutil
    if not os.path.isdir('saved_images'): os.mkdir('saved_images')
    if os.path.isdir(os.path.join('saved_images', EXP_NAME)): shutil.rmtree(os.path.join('saved_images', EXP_NAME))
    os.mkdir(os.path.join('saved_images', EXP_NAME))
    os.mkdir(os.path.join('saved_images', EXP_NAME, 'Real'))
    os.mkdir(os.path.join('saved_images', EXP_NAME, 'Fake'))

